[
  {
    "id" : 0 ,
    "title" : "Webpack" ,
    "description" : "Webpack - это пакет модулей. Он упаковывает модули CommonJs / AMD, т. е. для браузера. Позволяет разбить вашу кодовую базу на несколько пакетов, которые могут быть загружены по требованию."
  },
  {
    "id" : 1 ,
    "title" : "React" ,
    "description" : "React упрощает создание интерактивных пользовательских интерфейсов. Создавайте простые представления для каждого состояния в вашем приложении, и React будет эффективно обновлять и отображать только нужные компоненты при изменении ваших данных"
  },
  {
    "id" : 2 ,
    "title" : "Redux" ,
    "description" : "Redux - это контейнер с предсказуемым состоянием для приложений JavaScript. Он помогает создавать приложения, которые работают согласованно, работают в разных средах (клиентских, серверных и собственных) и их легко тестировать"
  },
  {
    "id" : 3 ,
    "title" : "React-Redux" ,
    "description" : "React-Redux - это официальный набор связей между библиотеками React и Redux. С помощью этой библиотеки вы можете синхронизировать свои представления и данные."
  },
  {
    "id" : 4 ,
    "title" : "Lodash" ,
    "description" : "Современная библиотека утилит JavaScript, обеспечивающая модульность, производительность и дополнительные возможности. Lodash выпускается под лицензией MIT и поддерживает современные среды."
  },
  {
    "id" : 5 ,
    "title" : "Redux-Thunk" ,
    "description" : "Промежуточное ПО Redux Thunk позволяет писать создателям действий, которые возвращают функцию вместо действия. Thunk можно использовать для задержки отправки действия или для отправки только при соблюдении определенного условия."
  },
  {
    "id" : 6 ,
    "title" : "ESLint" ,
    "description" : "ESLint - это утилита линтинга JavaScript с открытым исходным кодом, изначально созданная Николасом К. Закасом в июне 2013 года. Линтирование кода - это тип статического анализа, который часто используется для поиска проблемных шаблонов или кода, который не придерживается определенного стиля. методические рекомендации."
  },
  {
    "id" : 7 ,
    "title" : "Babel" ,
    "description" : "Babel поддерживает последнюю версию JavaScript с помощью преобразователей синтаксиса. Эти плагины позволяют использовать новый синтаксис прямо сейчас, не дожидаясь поддержки браузера"
  },
  {
    "id" : 8 ,
    "title" : "Axios" ,
    "description" : "HTTP-клиент на основе Promise для браузера и node.js. С помощью Axios вы можете создавать XMLHttpRequest из браузера или узла с полной версией Promise Api."
  }
]